app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build(pin_params)
      if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 24 Oct 2013 18:32:11 UTC +00:00], ["description", "Pin #2"], ["updated_at", Thu, 24 Oct 2013 18:32:11 UTC +00:00], ["user_id", 2]]